routes/web.php


// Récupérer tous les éditeurs (avec le query builder) :
Route::get('sdz_books/query_builder/01', function() {
    $editeurs = DB::table('sdz_editeurs')->get();
---
select * from `sdz_editeurs`


// Obtenir un tableau de valeurs d'une Colonne (avec le query builder) :
Route::get('sdz_books/query_builder/lists/02', function() {
    $editeurs = DB::table('sdz_editeurs')->pluck('nom');
---
select `nom` from `sdz_editeurs`