app/Repositories/Sdz/PostRepository.php

select * from `sdz_users` where `sdz_users`.`id` in ('2')
---
    private function queryWithUserAndTags()
    {
        return $this->post->with('user','tags')
            ->orderBy('sdz_posts.created_at', 'desc');

select `sdz_tags`.*, `sdz_post_tag`.`post_id` as `pivot_post_id`, `sdz_post_tag`.`tag_id` as `pivot_tag_id` from `sdz_tags` inner join `sdz_post_tag` on `sdz_tags`.`id` = `sdz_post_tag`.`tag_id` where `sdz_post_tag`.`post_id` in ('109', '108', '107', '106')
---
    public function getWithUserAndTagsPaginate($n)
    {
        return $this->queryWithUserAndTags()->paginate($n);

select `sdz_tags`.*, `sdz_post_tag`.`post_id` as `pivot_post_id`, `sdz_post_tag`.`tag_id` as `pivot_tag_id` from `sdz_tags` inner join `sdz_post_tag` on `sdz_tags`.`id` = `sdz_post_tag`.`tag_id` where `sdz_post_tag`.`post_id` in ('90', '35', '38', '23')
---
    public function getWithUserAndTagsForTagPaginate($tag, $n)
    {
        return $this->queryWithUserAndTags()
            ->whereHas('tags', function($q) use($tag)
                {
                    $q->where('sdz_tags.tag_url', $tag);
                }
            )->paginate($n);

select * from `sdz_users` where `sdz_users`.`id` in ('8', '7', '10')
---
    public function getPaginate($n)
    {
        return $this->post->with('user')
            ->orderBy('sdz_posts.created_at','desc')
            ->paginate($n);

insert into `sdz_posts` (`titre`, `contenu`, `user_id`, `updated_at`, `created_at`) values ('xsxsxs', 'xsxsxsxsqxsfdfd', '2', '2020-02-15 03:44:19', '2020-02-15 03:44:19')
---
    public function store($inputs)
    {
        return $this->post->create($inputs);