app/Repositories/Sdz/PostRepository.php

select * from `sdz_posts` order by `sdz_posts`.`created_at` desc limit 4 offset 92
select count(*) as aggregate from `sdz_posts`
---
    public function getPaginate($n)
    {
        // return $this->model->with('user')
        return $this->post->with('user')
            ->orderBy('sdz_posts.created_at','desc')
            ->paginate($n);